# RoomLevelElevs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..RoomLevelElevs Property
BuiltInFailures..::..RoomFailures Class See Also
---
A [Room]s Upper Limit must be above its Base Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomLevelElevs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomLevelElevs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomLevelElevs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace